Tekla.Structures.Drawing.FontAttributes
The FontAttributes class contains the basic attributes for fonts.

Tekla.Structures.Drawing.FontAttributes.Color
The color of the font.

Tekla.Structures.Drawing.FontAttributes.TrueColor
The true color (rgb enabled) of the font.
Throws System.ArgumentOutOfRangeException: The get method will
throw if the inputColor is not supported (0-7, 120 for example).
You should use this function in a try-catch statement, since
non-supported colors are used in TeklaStructures, especially in
older models. Define your own catch logic (default color, error
message, etc) based on your use case.

Tekla.Structures.Drawing.FontAttributes.Height
The height of the font (in millimeters).

Tekla.Structures.Drawing.FontAttributes.Name
The name of the font.

Tekla.Structures.Drawing.FontAttributes.Italic
Whether the font is italic.

Tekla.Structures.Drawing.FontAttributes.Bold
Whether the font is bold.

Tekla.Structures.Drawing.FontAttributes.#ctor
Creates a new font attributes instance. The default color is black, the height is 2.5,
the font name is Arial and the values of italic and bold are false.

Tekla.Structures.Drawing.FontAttributes.#ctor(Tekla.Structures.Drawing.DrawingColors,System.Double,System.String,System.Boolean,System.Boolean)
Creates a new font attributes instance with the given parameters.
color: The color of the font.
height: The height of the font.
fontName: The name of the font.
italic: The italic specifier.
bold: The bold specifier.

Tekla.Structures.Drawing.FontAttributes.#ctor(Tekla.Structures.Drawing.TeklaDrawingColor,System.Double,System.String,System.Boolean,System.Boolean)
Creates a new font attributes instance with the given parameters.
color: The true RGB color of the font.
height: The height of the font.
fontName: The name of the font.
italic: The italic specifier.
bold: The bold specifier.

Tekla.Structures.Drawing.FontAttributes.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.

Tekla.Structures.Drawing.FontAttributes.Clone
Creates a new object that is a copy of the current instance.
Returns:
A new object that is a copy of the current instance.
2